"use client";
// use client
import { useState } from "react";
import HeaderModal from "../components/NewModal";
import TopForm from "../components/TopForm";
import Contents from "../components/Contents";
import Footer from "../components/Footer";
import BirthdayForm from "./BirthdayForm";
import "./alco.css";

function Birthday() {
  const currentDate = new Date();
  const currentDay = currentDate.getDate();
  const currentMonth = currentDate.getMonth();
  const currentYear = currentDate.getFullYear();

  const [day, setDay] = useState(currentDay.toString());
  const [month, setMonth] = useState(currentMonth.toString());
  const [year, setYear] = useState(currentYear.toString());
  const [dayOfWeek, setDayOfWeek] = useState("");

  return (
    <>
      <HeaderModal />
      <TopForm
        title={"День недели "}
        description={
          "Иногда бывает нужно узнать, какой день недели соответствует определенной дате. Будь то день рождения друга, праздник или начало отпуска, удобный онлайн калькулятор дня недели справится с этой задачей. Просто введите нужную дату, и вы мгновенно узнаете, в какой день недели она приходится. Это просто и быстро, экономя ваше время для более важных дел или отдыха."
        }
        span={"рождения"}
      >
        <BirthdayForm
          day={day}
          month={month}
          year={year}
          setDayOfWeek={setDayOfWeek}
        >
          <div className="my_form">
            <label>
              <span> День</span>
              <select value={day} onChange={(e) => setDay(e.target.value)}>
                <option value="">Выберите день</option>
                {Array.from({ length: 31 }, (_, i) => i + 1).map((day) => (
                  <option key={day} value={day}>
                    {day}
                  </option>
                ))}
              </select>
            </label>
            <label>
              <span> Месяц</span>
              <select value={month} onChange={(e) => setMonth(e.target.value)}>
                <option value="">Выберите месяц</option>
                {Array.from({ length: 12 }, (_, i) => i).map((month) => (
                  <option key={month} value={month}>
                    {
                      [
                        "Январь",
                        "Февраль",
                        "Март",
                        "Апрель",
                        "Май",
                        "Июнь",
                        "Июль",
                        "Август",
                        "Сентябрь",
                        "Октябрь",
                        "Ноябрь",
                        "Декабрь",
                      ][month]
                    }
                  </option>
                ))}
              </select>
            </label>
            <label>
              <span> Год</span>
              <input
                type="text"
                value={year}
                onChange={(e) => setYear(e.target.value)}
                placeholder="Введите год"
              />
            </label>
          </div>
        </BirthdayForm>
      </TopForm>
      <Contents>
        <h2>Путеводитель в Мире Дней Недели</h2>
        <p>
          Иногда нам требуется определить, какой день недели был в определенный
          момент времени. Это может быть день рождения, праздник или просто
          важное событие, которое хочется запомнить. Для удобства создан
          специальный онлайн калькулятор, который помогает точно определить день
          недели по любой дате.
        </p>
        <h2>Узнайте Больше о Времени</h2>
        <p>
          Калькулятор дня недели предоставляет широкие возможности
          использования. Он помогает узнать день недели, когда вы или ваши
          близкие родились, что может стать интересным фактом для обсуждения или
          просто для удовлетворения любопытства. Но кроме того, этот инструмент
          может быть полезен и в повседневной жизни, помогая планировать важные
          события или встречи.
        </p>
        <h2>Откройте Новые Горизонты</h2>
        <p>
          Интересно, что некоторые люди верят в то, что те, кто родился в один
          день недели, имеют схожие черты характера или судьбу. Используя
          калькулятор, можно провести небольшое исследование и узнать,
          действительно ли есть что-то общее у людей, родившихся в один день
          недели.
        </p>
        <h2>Индивидуальные Рекомендации</h2>
        <p>
          Один из интересных аспектов использования калькулятора – это
          возможность получить рекомендации по своей сфере деятельности в
          зависимости от дня недели вашего рождения. Это может помочь лучше
          понять себя и найти подходящую работу или хобби, соответствующее вашим
          предпочтениям и склонностям.
        </p>
        <h2>Наслаждайтесь Исследованиями</h2>
        <p>
          Каждый раз, когда вы используете калькулятор дня недели, открывается
          возможность узнать что-то новое о себе и мире вокруг вас. Это как
          небольшое приключение каждый раз, когда вы вводите новую дату и
          получаете результат. Поэтому наслаждайтесь этим процессом и
          развивайтесь с удовольствием!
        </p>
        <h2>Путешествие Во Времени</h2>
        <p>
          Использование калькулятора дня недели – это как путешествие во
          времени. Вы можете вспомнить важные события из своей жизни и узнать, в
          какой день недели они произошли. Это помогает укрепить вашу память и
          превратить случайные воспоминания в систематизированные знания.
        </p>
        <h2>Управляйте Своим Временем</h2>
        <p>
          Каждый день недели имеет свою энергетику и атмосферу. Они определяют
          наши ежедневные ритмы, влияют на наше настроение и даже вдохновляют на
          творчество. Используя калькулятор дня недели, мы можем глубже
          погрузиться в этот мир и понять его тонкости.
        </p>
        <h2>Вдохновение и Поддержка</h2>
        <p>
          Как дополнительный бонус, калькулятор дня недели может стать вашим
          персональным дневным гороскопом. Узнав день недели для конкретной
          даты, вы можете получить вдохновение и поддержку для своих планов и
          решений. Это как невидимая сила, которая помогает вам двигаться
          вперед, даже когда кажется, что все против вас.
        </p>
        <h2>Знание – Сила</h2>
        <p>
          Использование калькулятора дня недели дарит вам знание. И знание, как
          известно, – это сила. Но важно использовать эту силу с умом и
          добросовестно. Помогайте другим, делитесь своими знаниями и стремитесь
          к лучшему – вот что делает вас настоящим мастером времени.
        </p>
        <h2>Время – Это Жизнь</h2>
        <p>
          В конечном счете, калькулятор дня недели напоминает нам о том, что
          время – это самое ценное, что у нас есть. Наслаждайтесь каждым
          моментом своей жизни, используйте его с умом и благодарите судьбу за
          каждый новый день. Пусть каждый день недели будет для вас новым
          приключением и возможностью стать лучше!
        </p>
        <p>
          <a href="/">Выбрать другой калькулятор</a>
        </p>
      </Contents>
      <Footer />
    </>
  );
}

export default Birthday;
