"use client";
import TopForm from "../components/TopForm";
import HeaderModal from "../components/HeaderModal";
import Footer from "../components/Footer";
import Form from "../components/Form";
import { useState } from "react";
import Contents from "../components/Contents";
import "./age.css";

let currentDate = new Date();
let formattedDate = currentDate.toISOString().split("T")[0];

function Agecalc() {
  const [date, setDate] = useState("");
  const [vDate, setVdate] = useState(formattedDate);
  const obj = {
    startDate: date,
    endDate: vDate,
  };

  return (
    <>
      <HeaderModal />

      <TopForm
        title={"Калькулятор"}
        description={
          "Просто введите дату рождения и определите, сколько человеку лет."
        }
        span={"возраста"}
      >
        <Form
          obj={obj}
          url={"https://calcoffee.ru/api/calculate/age"}
          formTitle={"Возраст :"}
          nextDay={"Следующий день рождения :"}
          ostatokDay={"Осталось до дня рождения : "}
          year={" год"}
          month={" месяцев"}
          days={" дней"}
          hour={" часов"}
          minut={" минут"}
          sec={" секунд"}
          dn={" дн."}
        >
          <label className="numrange row-1 van">
            <span>Дата рождения</span>
            <input
              type="date"
              className="input"
              id="nheight"
              min="0"
              max="250"
              value={date}
              onChange={(e) => setDate(e.target.value)}
            />
          </label>

          <label className="numrange row-1 two">
            <span>Возраст на дату</span>
            <input
              type="date"
              className="input"
              id="nweight"
              min="0"
              max="250"
              value={vDate}
              onChange={(e) => setVdate(e.target.value)}
            />
          </label>
        </Form>

        <Contents>
          <h2 className="tops-content">
            Калькулятор Возраста Онлайн - Узнай Свой Точный Возраст
          </h2>
          <p>
            Добро пожаловать на наш онлайн калькулятор возраста! Это удобный
            инструмент, который позволяет вам быстро и точно определить свой
            возраст. Введите дату своего рождения (день, месяц и год) и нажмите
            кнопку “Рассчитать”. Наш калькулятор мгновенно вычислит количество
            прожитых лет, месяцев, недель, дней, часов, минут и секунд. По
            умолчанию, конечная дата устанавливается на сегодняшний день, но вы
            можете изменить ее на любую другую дату.
          </p>
          <h3>Как Использовать Калькулятор Возраста</h3>
          <p>
            Использование нашего калькулятора возраста очень просто. Введите
            свою дату рождения и нажмите кнопку “Рассчитать”. В результате вы
            получите точные данные о вашем возрасте в годах, месяцах, неделях,
            днях, часах, минутах и секундах. Например, если вы родились 15
            января 1990 года, и сегодня 24 июля 2024 года, то ваш возраст
            составит 34 года, 6 месяцев и 9 дней.
          </p>
          <h3>Узнать Возраст на Определенную Дату</h3>
          <p>
            Наш калькулятор позволяет узнать ваш возраст на любую выбранную
            дату. Для этого используйте функцию “Возраст на дату”. Введите свою
            дату рождения в первое поле и желаемую дату для расчета во второе
            поле. Нажмите “Рассчитать” и мгновенно получите результат.
          </p>
          <p>
            Например, если вам интересно, сколько вам было лет на момент вашего
            выпуска из школы, введите свою дату рождения и дату выпуска.
            Предположим, вы родились 1 сентября 2005 года, а выпускной был 25
            мая 2023 года. Наш калькулятор покажет, что на момент выпуска вам
            было 17 лет, 8 месяцев и 24 дня.
          </p>
          <p>
            Также можно узнать, сколько вам будет лет на определённый будущий
            день. Например, если вы хотите знать свой возраст на дату вашего
            50-летия, введите свою дату рождения и дату вашего 50-летия. Если вы
            родились 1 сентября 2005 года, то вам будет 50 лет 1 сентября 2055
            года.
          </p>
          <h3>Прогнозирование Возраста на Будущее</h3>
          <p>
            С помощью нашего калькулятора вы можете прогнозировать свой возраст
            на будущие даты. Это полезно для планирования юбилеев, важных
            событий или просто для интереса. Введите дату рождения и желаемую
            будущую дату, чтобы узнать, сколько вам будет лет.
          </p>
          <p>
            Например, если вы хотите знать, сколько вам будет лет на ваше
            100-летие, просто введите свою дату рождения и дату вашего
            100-летия. Если вы родились 15 января 1990 года, то 15 января 2090
            года вам исполнится 100 лет. Наш калькулятор покажет вам точный
            возраст на эту дату.
          </p>
          <h3>Примеры Использования Калькулятора Возраста</h3>
          <p>
            Рассмотрим несколько примеров, чтобы продемонстрировать возможности
            нашего калькулятора:
          </p>
          <p>
            1. Вы хотите узнать, сколько вам было лет на момент начала 21-го
            века (1 января 2000 года). Введите свою дату рождения, например, 10
            июня 1980 года, и дату 1 января 2000 года. Калькулятор покажет, что
            вам было 19 лет, 6 месяцев и 22 дня.
          </p>
          <p>
            2. Вы планируете отметить свой 30-й день рождения и хотите узнать, в
            какой день недели он будет. Введите свою дату рождения, например, 20
            марта 1994 года, и дату своего 30-летия (20 марта 2024 года).
            Калькулятор покажет, что это будет среда.
          </p>
          <p>
            3. Вы хотите узнать, сколько вам будет лет на ваш золотой юбилей (50
            лет). Введите свою дату рождения, например, 5 мая 1975 года, и дату
            5 мая 2025 года. Калькулятор покажет, что вам будет 50 лет.
          </p>
          <h3>Преимущества Нашего Калькулятора Возраста</h3>

          <ul>
            <li>
              <strong>Точность:</strong> Наш калькулятор предоставляет точные
              результаты на основе введенных данных.
            </li>
            <li>
              <strong>Удобство:</strong> Легкий и интуитивно понятный интерфейс
              делает использование калькулятора быстрым и простым.
            </li>
            <li>
              <strong>Многофункциональность:</strong> Возможность расчета
              возраста как на текущий момент, так и на любую другую дату в
              прошлом или будущем.
            </li>
          </ul>

          <p>
            Используйте наш калькулятор возраста для точных расчетов и
            прогнозирования, и наслаждайтесь удобством и точностью, которые он
            предоставляет.
          </p>
          <p>
            <a href="/">Выбрать другой калькулятор</a>
          </p>
        </Contents>
      </TopForm>
      <Footer />
    </>
  );
}

export default Agecalc;
